beforelight/IMRT10XX/board/pin_mux.c
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v7.0
processor: MIMXRT1052xxxxB
package_id: MIMXRT1052CVL5B
mcu_data: ksdk2_0
processor_version: 7.0.1
pin_labels:
- {pin_num: M11, pin_signal: GPIO_AD_B0_02, label: 外接k66, identifier: LED1}
- {pin_num: L6, pin_signal: WAKEUP, label: WEKAUP/WAKEUP&LED, identifier: WAKEUP}
- {pin_num: M6, pin_signal: ONOFF, label: ONOFF, identifier: ONOFF}
- {pin_num: D9, pin_signal: GPIO_B0_10, label: BT_CFG6/PD, identifier: WRX;WR}
- {pin_num: A10, pin_signal: GPIO_B0_11, label: BT_CFG7/PD, identifier: CSX;DC}
- {pin_num: L14, pin_signal: GPIO_AD_B0_13, label: DEBUG, identifier: DEBUG}
- {pin_num: K14, pin_signal: GPIO_AD_B0_12, label: DEBUG, identifier: DEBUG}
- {pin_num: F11, pin_signal: GPIO_AD_B0_04, label: ' PD/0_SPI/1_Serial Downloader/BOOT_MODE0/PD/BOOT_MODE0/PD', identifier: BT_PD_0_SPI__1_SerialDownloader}
- {pin_num: G14, pin_signal: GPIO_AD_B0_05, label: bee PD/0/BOOT_MODE1/PU/BOOT_MODE1/PU, identifier: BT_PD_0}
- {pin_num: A12, pin_signal: GPIO_B1_08, label: keyboard/C0/C0, identifier: D0;C0}
- {pin_num: A13, pin_signal: GPIO_B1_09, label: keyboard/C1/C1, identifier: D1;C1}
- {pin_num: B13, pin_signal: GPIO_B1_10, label: keyboard/OE_B/OE_B, identifier: DC;OE_B}
- {pin_num: F13, pin_signal: GPIO_AD_B0_08, label: keyboard JTAG_MOD/JTAG_MOD/PD/JTAG_MOD/PD, identifier: BEE}
- {pin_num: D13, pin_signal: GPIO_B1_12, label: CD, identifier: CD}
- {pin_num: H2, pin_signal: GPIO_SD_B0_04, label: D2, identifier: D2}
- {pin_num: J1, pin_signal: GPIO_SD_B0_02, label: D0, identifier: D0}
- {pin_num: J2, pin_signal: GPIO_SD_B0_05, label: D3, identifier: D3}
- {pin_num: J3, pin_signal: GPIO_SD_B0_01, label: CLK, identifier: CLK}
- {pin_num: J4, pin_signal: GPIO_SD_B0_00, label: CMD, identifier: CMD}
- {pin_num: K1, pin_signal: GPIO_SD_B0_03, label: D1, identifier: DATA1;D1}
- {pin_num: N3, pin_signal: GPIO_SD_B1_05, label: SDA, identifier: SDA}
- {pin_num: P2, pin_signal: GPIO_SD_B1_04, label: SCL, identifier: SCL}
- {pin_num: D7, pin_signal: GPIO_B0_00, label: D0, identifier: D0;DC}
- {pin_num: E7, pin_signal: GPIO_B0_01, label: D1, identifier: D1;RES}
- {pin_num: E8, pin_signal: GPIO_B0_02, label: D2, identifier: D2;D1}
- {pin_num: D8, pin_signal: GPIO_B0_03, label: D3, identifier: D3;D0}
- {pin_num: C8, pin_signal: GPIO_B0_04, label: BT_CFG0/PD, identifier: D4}
- {pin_num: B8, pin_signal: GPIO_B0_05, label: BT_CFG1/PD, identifier: D5}
- {pin_num: A8, pin_signal: GPIO_B0_06, label: BT_CFG2/PD, identifier: D6}
- {pin_num: A9, pin_signal: GPIO_B0_07, label: BT_CFG3/PD, identifier: D7}
- {pin_num: B11, pin_signal: GPIO_B1_01, label: 总钻风}
- {pin_num: A11, pin_signal: GPIO_B1_00, label: 总钻风}
- {pin_num: C10, pin_signal: GPIO_B0_12, label: BT_CFG8/PD, identifier: WR}
- {pin_num: D10, pin_signal: GPIO_B0_13, label: BT_CFG9/PD, identifier: DC}
- {pin_num: B9, pin_signal: GPIO_B0_08, label: BT_CFG4/PD}
- {pin_num: C9, pin_signal: GPIO_B0_09, label: BT_CFG5/PD}
- {pin_num: E10, pin_signal: GPIO_B0_14, label: BT_CFG10/PD, identifier: BEE}
- {pin_num: E11, pin_signal: GPIO_B0_15, label: BT_CFG11/PD, identifier: RES;SC;CS}
- {pin_num: G11, pin_signal: GPIO_AD_B0_03, label: 外接k66}
- {pin_num: L7, pin_signal: PMIC_STBY_REQ, label: PMIC_STBY, identifier: PMIC_STBY}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

#include "fsl_common.h"
#include "fsl_xbara.h"
#include "fsl_iomuxc.h"
#include "fsl_gpio.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 * 
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 * 
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void) {
    ADC();
    xSNVS();
    SD();
    camera();
    LCD();
    SWD();
    ENC();
    UART();
    SPI();
    IIC();
    GPIO();
    PWM();
}

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
ADC:
- options: {callFromInitBoot: 'true', coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: H14, peripheral: ADC1, signal: 'IN, 3', pin_signal: GPIO_AD_B0_14}
  - {pin_num: L10, peripheral: ADC1, signal: 'IN, 4', pin_signal: GPIO_AD_B0_15}
  - {pin_num: J11, peripheral: ADC1, signal: 'IN, 5', pin_signal: GPIO_AD_B1_00}
  - {pin_num: K11, peripheral: ADC1, signal: 'IN, 6', pin_signal: GPIO_AD_B1_01}
  - {pin_num: L11, peripheral: ADC1, signal: 'IN, 7', pin_signal: GPIO_AD_B1_02}
  - {pin_num: M12, peripheral: ADC1, signal: 'IN, 8', pin_signal: GPIO_AD_B1_03}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : ADC
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void ADC(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc);           /* iomuxc clock (iomuxc_clk_enable): 0x03U */

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_B0_14_GPIO1_IO14,        /* GPIO_AD_B0_14 is configured as GPIO1_IO14 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_B0_15_GPIO1_IO15,        /* GPIO_AD_B0_15 is configured as GPIO1_IO15 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_B1_00_GPIO1_IO16,        /* GPIO_AD_B1_00 is configured as GPIO1_IO16 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_B1_01_GPIO1_IO17,        /* GPIO_AD_B1_01 is configured as GPIO1_IO17 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_B1_02_GPIO1_IO18,        /* GPIO_AD_B1_02 is configured as GPIO1_IO18 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_B1_03_GPIO1_IO19,        /* GPIO_AD_B1_03 is configured as GPIO1_IO19 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
}


